-- В таблице Н_ПЛАНЫ вывести в виде дерева иерархию полей ПЛАН_ИД

-- ПЛАН 1
--     ПЛАН 1.1
--     ПЛАН 1.2
-- ПЛАН 2
--     ПЛАН 2.1
--     ПЛАН 2.2
--     ПЛАН 2.3

WITH RECURSIVE ИЕРАРХИЯ_ПЛАНОВ AS (
    SELECT  Н_ПЛАНЫ.ИД, 
            Н_ПЛАНЫ.ПЛАН_ИД, 
            0 AS УРОВЕНЬ, 
            format('%s', Н_ПЛАНЫ.ИД) AS ИМЯ,
            format('ПЛАН %s', Н_ПЛАНЫ.ИД) AS РЕЗУЛЬТАТ
    FROM Н_ПЛАНЫ
    WHERE Н_ПЛАНЫ.ПЛАН_ИД IS NULL

    UNION ALL
    SELECT  Н_ПЛАНЫ.ИД, 
            Н_ПЛАНЫ.ПЛАН_ИД, 
            ИЕРАРХИЯ_ПЛАНОВ.УРОВЕНЬ + 1,
            format('%s.%s', ИЕРАРХИЯ_ПЛАНОВ.ИМЯ, Н_ПЛАНЫ.ИД),
            format('%sПЛАН %s', repeat('__', ИЕРАРХИЯ_ПЛАНОВ.УРОВЕНЬ + 1), format('%s.%s', ИЕРАРХИЯ_ПЛАНОВ.ИМЯ, Н_ПЛАНЫ.ИД))
    FROM ИЕРАРХИЯ_ПЛАНОВ    
    JOIN Н_ПЛАНЫ ON Н_ПЛАНЫ.ПЛАН_ИД = ИЕРАРХИЯ_ПЛАНОВ.ИД
)
SELECT РЕЗУЛЬТАТ
FROM ИЕРАРХИЯ_ПЛАНОВ
ORDER BY ИМЯ; 